---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricArea.CopyCurveLoopsInSketch
source: html/5605fe73-f63e-ee85-2670-4765dc11641b.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.CopyCurveLoopsInSketch Method

Creates copies of the CurveLoops in the FabricArea sketch.

## Syntax (C#)
```csharp
public IList<CurveLoop> CopyCurveLoopsInSketch()
```

## Returns
The copy of the curve loops.